Revit 2027 API
PipeSettings.GetSpecificFittingAngleStatus Method
 Gets the status of given specific angle.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetSpecificFittingAngleStatus(
	double angle
)
Public Function GetSpecificFittingAngleStatus (
	angle As Double
) As Boolean
public:
bool GetSpecificFittingAngleStatus(
	double angle
)
member GetSpecificFittingAngleStatus :
        angle : float -> bool
Parameters
angle Double
 The specific fitting angle (in degree) that must be one of 90, 60, 45, 30, 22.5 or 11.25 degrees.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace